# StirrupTieBendDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BarTypeDiameterOptions..::..StirrupTieBendDiameter Property
BarTypeDiameterOptions Class See Also
---
Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double StirrupTieBendDiameter { get; set; }
```

Visual Basic
---
```text
Public Property StirrupTieBendDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StirrupTieBendDiameter {
	double get ();
	void set (double value);
}
```

# See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace